Revit 2026 API

# BuiltInFailuresKeynoteFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresKeynoteFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class KeynoteFailures
```
```vb
Public NotInheritable Class KeynoteFailures
```
```cpp
public ref class KeynoteFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeynoteFailures = class end
```

The BuiltInFailuresKeynoteFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MissKeynoteParameter | No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system. |
|  | MissKeynotingSystem | No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family. |
|  | NotAssociatedKeynoteParameter | Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system. |

#### Reference

Autodesk.Revit.DB Namespace